# 포만코드 대조표

phoman = {
    # Consonants
    "p": "p",
    "b": "B",
    "t": "T",
    "d": "D",
    "k": "K",
    "ɡ": "G",
    "tʃ": "T#",
    "dʒ": "D3",
    "f": "F",
    "v": "V",
    "θ": "*",
    "ð": "&",
    "s": "S",
    "z": "Z",
    "ʃ": "#",
    "ʒ": "3",
    "h": "H",
    "m": "M",
    "n": "N",
    "ŋ": "Q",
    "l": "L",
    "r": "R",
    "j": "J",
    "w": "W",

    # Vowels
    "iː": "!:",
    "i": "!",
    "ɪ": "!",
    "e": "E",
    "æ": "@",
    "ɑː": "A:",
    "ɒ": "O",
    "ɔː": "O:",
    "ʊ": "U",
    "u": "U",
    "uː": "U:",
    "ʌ": "^",
    "ɜː": "C:",
    "ə": "C",
    "eɪ": "E!",
    "əʊ": "CU",
    "aɪ": "A!",
    "ɔɪ": "O!",
    "aʊ": "AU",
    "ɪə": "!C",
    "eə": "EC",
    "ʊə": "UC",
}

# 자음부
consonant = {
    # 마찰음
    "S": "ㅅ",
    "*": "ㅅ",
    "#": "ㅅ",
    "Z": "ㅈ",
    "3": "ㅈ",
    "F": "ㅍ",
    "V": "ㅂ",
    "&": "ㄷ",

    # 무성 파열음
    "P": "ㅍ",
    "T": "ㅌ",
    "K": "ㅋ",

    # 파찰음
    "TS": "ㅊ",
    "T#": "ㅊ",
    "D3": "ㅈ",
    "DZ": "ㅈ",

    # 비음
    "M": "ㅁ",
    "N": "ㄴ",
    "Q": "ᆼ",  # 종성 'ㅇ'

    # 유성 파열음
    "B": "ㅂ",
    "D": "ㄷ",
    "G": "ㄱ",

    # 유음
    "L": "ㄹ",
    "R": "ㄹ",
    "H": "ㅎ",
}

vowel = {
    # 단모음
    "!": "ㅣ",
    "I": "ㅣ",
    "^": "ㅓ",
    "C": "ㅓ",
    "c": "ㅓ",
    "E": "ㅔ",
    "A": "ㅏ",
    "U": "ㅜ",
    "O": "ㅗ",

    # 이중모음
    "@": "ㅐ",
    "q": "ㅚ",
    "OU": "ㅗ",
    "AUC": "ㅏ워",
    "UC": "ㅝ",

    # 반모음
    "W!": "ㅟ",
    "W^": "ㅝ",
    "WC": "ㅝ",
    "WE": "ㅞ",
    "WA": "ㅘ",
    "WU": "ㅜ",
    "WO": "ㅝ",
    "WOU": "ㅝ",
    "W@": "ㅙ",
    "J!": "ㅣ",
    "J^": "ㅕ",
    "JC": "ㅕ",
    "JE": "ㅖ",
    "JA": "ㅑ",
    "JU": "ㅠ",
    "JO": "ㅛ",
    "J@": "ㅒ",
}
